lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/BLE/NordicUart/BleNordicUartLoopbackProbe/BleNordicUartLoopbackProbe.ino
/*
 * BleNordicUartLoopbackProbe
 *
 * Echo server over the Nordic UART Service (NUS): every byte received from
 * the central is immediately sent back via NUS TX notification. Useful for:
 *   - Testing NUS throughput and reliability.
 *   - Verifying that a NUS central (app or board) can both send and receive.
 *   - Measuring BLE link drop rates by comparing sent vs. echoed byte counts.
 *
 * On connect, the sketch:
 *   1. Enables the background connection service for ATT/GATT handling.
 *   2. Optionally sends an SMP Security Request so the central can pair/encrypt.
 *   3. Sends a welcome banner once the NUS TX CCCD is enabled.
 *   4. Echoes received bytes back at up to one full notification per connection
 *      event, with a high-water check to prevent txBuffer overflow.
 *
 * Gotcha: peripheral-initiated SMP Security Request is intentionally disabled
 * by default here. Android NUS apps are primarily interested in getting the
 * TX CCCD enabled quickly; forcing a bond request during early discovery can
 * stall or time out CCCD writes. Use BlePairingEncryptionStatus.ino when you
 * want to validate pairing/encryption, or opt in below for loopback-specific
 * security testing.
 *
 * Back-pressure design: pumpLoopback() only reads from rxBuffer when txBuffer
 * holds fewer than 2 × kPollBudgetBytes (40 bytes). The threshold is a fixed
 * compile-time constant so it is not affected by ATT MTU negotiation; using
 * maxPayloadLength() instead would inflate the threshold to 244 after an MTU
 * exchange and lock reads permanently once txBuffer hit 242 bytes. Bytes not
 * yet read stay in rxBuffer (1 KB) until the pipeline clears.
 *
 * Default runtime is intentionally quiet while connected. Verbose periodic
 * status is available for debugging, but printing to USB CDC during an active
 * BLE session can delay connection-event polling enough to hurt Android
 * service discovery and CCCD writes.
 */

#include <Arduino.h>

#include "ble_nus.h"

using namespace xiao_nrf54l15;

static BleRadio g_ble;
static BleNordicUart g_nus(g_ble);
static PowerManager g_power;
static uint16_t g_diagServiceHandle = 0U;
static uint16_t g_diagValueHandle = 0U;

static bool g_wasConnected = false;
static bool g_bannerSent = false;  // True once welcome banner has been sent.
static bool g_securityRequested = false;
static uint32_t g_lastStatusMs = 0U;
static uint32_t g_connectedAtMs = 0U;
static uint32_t g_echoedBytes = 0U;   // Bytes echoed this connection.
static uint32_t g_droppedBytes = 0U;  // Bytes dropped this connection (TX full).
volatile uint32_t g_connectCount = 0U;
volatile uint32_t g_disconnectCount = 0U;
volatile uint32_t g_pollEventCount = 0U;
volatile uint32_t g_pollNoEventCount = 0U;
volatile uint16_t g_lastEventCounter = 0U;
volatile uint8_t g_lastDataChannel = 0U;
volatile uint8_t g_lastDisconnectReason = 0U;
volatile uint8_t g_lastDisconnectReasonRemote = 0U;
volatile uint8_t g_initOk = 0U;
volatile uint8_t g_setupStage = 0U;
volatile uint8_t g_runtimeAddress[6] = {0U};
volatile uint8_t g_runtimeAddressType = 0xFFU;
volatile uint32_t g_unconnectedLoopCount = 0U;
volatile uint32_t g_advertiseCallCount = 0U;
volatile uint32_t g_advertiseOkCount = 0U;
volatile uint32_t g_advertiseFailCount = 0U;
volatile uint8_t g_lastAdvChannel = 0U;
volatile uint8_t g_lastAdvSawConnectInd = 0U;
volatile uint8_t g_lastAdvConnectIndChSel2 = 0U;
volatile uint8_t g_lastAdvSawScanReq = 0U;
volatile uint32_t g_advConnectIndCount = 0U;
volatile uint32_t g_advConnectedAfterEventCount = 0U;
volatile uint32_t g_advConnectIndLostBeforeLoopCount = 0U;
volatile uint8_t g_lastPostAdvConnected = 0U;
volatile uint8_t g_lastConnPeerAddress[6] = {0U};
volatile uint8_t g_lastConnPeerAddressRandom = 0U;
volatile uint32_t g_lastConnAccessAddress = 0U;
volatile uint32_t g_lastConnCrcInit = 0U;
volatile uint16_t g_lastConnIntervalUnits = 0U;
volatile uint16_t g_lastConnLatency = 0U;
volatile uint16_t g_lastConnTimeoutUnits = 0U;
volatile uint8_t g_lastConnChannelMap[5] = {0U};
volatile uint8_t g_lastConnChannelCount = 0U;
volatile uint8_t g_lastConnHopIncrement = 0U;
volatile uint8_t g_lastConnSleepClockAccuracy = 0U;
volatile uint32_t g_lastDisconnectSequence = 0U;
volatile uint32_t g_lastDisconnectNextEventUs = 0U;
volatile uint16_t g_lastDisconnectEventCounterDebug = 0U;
volatile uint16_t g_lastDisconnectMissedEventCount = 0U;
volatile uint8_t g_lastDisconnectRole = 0U;
volatile uint8_t g_lastDisconnectErrorCode = 0U;
volatile uint8_t g_lastDisconnectExpectedRxSn = 0U;
volatile uint8_t g_lastDisconnectTxSn = 0U;
volatile uint8_t g_lastDisconnectPendingTxValid = 0U;
volatile uint8_t g_lastDisconnectPendingTxLlid = 0U;
volatile uint8_t g_lastDisconnectPendingTxLength = 0U;
volatile uint8_t g_lastDisconnectLastTxOpcode = 0U;
volatile uint8_t g_lastDisconnectLastTxLength = 0U;
volatile uint8_t g_lastDisconnectLastRxOpcode = 0U;
volatile uint8_t g_lastDisconnectLastRxLength = 0U;
volatile uint8_t g_lastDisconnectValid = 0U;
volatile uint32_t g_dbgLatePollCount = 0U;
volatile uint32_t g_dbgConnRxTimeoutCount = 0U;
volatile uint32_t g_dbgConnMissedEventCountLast = 0U;
volatile uint32_t g_dbgConnMissedEventCountMax = 0U;
volatile uint32_t g_debugStage = 0U;
volatile uint32_t g_debugCheckpoint = 0U;
volatile uint32_t g_debugBannerAttemptCount = 0U;
volatile uint32_t g_debugBannerWriteCount = 0U;
volatile uint32_t g_debugPumpAttemptCount = 0U;
volatile uint32_t g_debugPumpWriteCount = 0U;
volatile uint32_t g_debugNotifyEnabledCount = 0U;
volatile uint32_t g_debugNusTxCount = 0U;
volatile uint32_t g_debugNusLastQueueResult = 0U;
volatile uint32_t g_debugNusSentCount = 0U;
volatile uint32_t g_debugNusRetiredCount = 0U;
volatile uint32_t g_debugNusInFlight = 0U;
volatile uint32_t g_debugNusAwaitingAck = 0U;
volatile uint32_t g_debugUnconnectedLoopCount = 0U;
volatile uint32_t g_debugAdvConnectIndCount = 0U;
volatile uint32_t g_debugPostAdvConnectedCount = 0U;
volatile uint32_t g_debugPostAdvDisconnectedCount = 0U;
volatile uint32_t g_debugDisconnectedRxPending = 0U;

