lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/BLE/NordicUart/BleNordicUartLoopbackProbe/BleNordicUartLoopbackProbe.ino
// 0 dBm: good for general-purpose probe work within a few metres.
static constexpr int8_t kTxPowerDbm = 0;
// Max bytes to read from rxBuffer per pumpLoopback() call.
// 20 = standard NUS MTU payload (ATT MTU 23 - 3 header bytes); matches one
// full notification so each event sends a maximally-packed PDU.
static constexpr uint8_t kPollBudgetBytes = 20U;
// Stop reading into txBuffer once it holds more than 2 × kPollBudgetBytes.
// Using kPollBudgetBytes (not maxPayloadLength()) as the unit keeps the
// threshold stable regardless of whether Android negotiates a large ATT MTU
// mid-connection — a large MTU would otherwise inflate the threshold to 244
// bytes, allow ~780 bytes into txBuffer, then block all reads permanently.
static constexpr int kTxFreeMin =
    static_cast<int>(BleNordicUart::kTxBufferSize) -
    2 * static_cast<int>(kPollBudgetBytes);
#ifndef NRF54L15_LOOPBACK_BG_SERVICE
#define NRF54L15_LOOPBACK_BG_SERVICE 1
#endif
static constexpr bool kEnableBleBgService =
    (NRF54L15_LOOPBACK_BG_SERVICE != 0);
static constexpr uint32_t kStatusPeriodMs = 2000UL;
#ifndef NRF54L15_LOOPBACK_VERBOSE_STATUS
#define NRF54L15_LOOPBACK_VERBOSE_STATUS 0
#endif
static constexpr bool kVerboseStatus =
    (NRF54L15_LOOPBACK_VERBOSE_STATUS != 0);
static constexpr uint32_t kConnectionPollTimeoutUs = 450000UL;
static constexpr uint32_t kForegroundPollTimeoutUs =
    kEnableBleBgService ? 0UL : kConnectionPollTimeoutUs;
static constexpr uint32_t kConnectionWarmupMs = 500UL;
#ifndef NRF54L15_LOOPBACK_REQUEST_SECURITY
#define NRF54L15_LOOPBACK_REQUEST_SECURITY 0
#endif
static constexpr bool kRequestLinkSecurity =
    (NRF54L15_LOOPBACK_REQUEST_SECURITY != 0);
// Optional fixed test address. Leave it off by default because the board's
// factory-derived BLE address is more discoverable on some phones.
static constexpr uint8_t kAddress[6] = {0x37, 0x00, 0x15, 0x54, 0xDE, 0xC0};
static constexpr bool kUseFixedAddress = false;
static constexpr char kGattName[] = "X54 NUS Loopback";
static constexpr char kBanner[] = "X54 NUS loopback ready\r\n";
static constexpr uint16_t kDiagServiceUuid = 0xFFF0U;
static constexpr uint16_t kDiagValueUuid = 0xFFF1U;
static const uint8_t kNusAdvPayload[] = {
    2, 0x01, 0x06,
    7, 0x09, 'X', '5', '4', '-', 'L', 'B',
    5, 0xFF, 0x34, 0x12, 0x54, 0x15,
};

static void writeLe32(uint8_t* out, uint32_t value) {
  if (out == nullptr) {
    return;
  }
  out[0] = static_cast<uint8_t>(value & 0xFFU);
  out[1] = static_cast<uint8_t>((value >> 8U) & 0xFFU);
  out[2] = static_cast<uint8_t>((value >> 16U) & 0xFFU);
  out[3] = static_cast<uint8_t>((value >> 24U) & 0xFFU);
}

static void writeLe16(uint8_t* out, uint16_t value) {
  if (out == nullptr) {
    return;
  }
  out[0] = static_cast<uint8_t>(value & 0xFFU);
  out[1] = static_cast<uint8_t>((value >> 8U) & 0xFFU);
}

static void snapshotNusDebug(uint32_t stage) {
  g_debugStage = stage;
  if (g_nus.isNotifyEnabled()) {
    ++g_debugNotifyEnabledCount;
  }
  g_debugNusTxCount = g_nus.debugTxCount();
  g_debugNusLastQueueResult = g_nus.debugLastQueueResult();
  g_debugNusSentCount = g_nus.debugNotificationSentCount();
  g_debugNusRetiredCount = g_nus.debugNotificationRetiredCount();
  g_debugNusInFlight = g_nus.debugTxNotificationInFlight() ? 1U : 0U;
  g_debugNusAwaitingAck = g_nus.debugTxNotificationAwaitingAck() ? 1U : 0U;

  if (g_diagValueHandle != 0U) {
    uint8_t diag[20] = {0};
    writeLe16(&diag[0], static_cast<uint16_t>(g_debugStage & 0xFFFFU));
    writeLe16(&diag[2], static_cast<uint16_t>(g_debugUnconnectedLoopCount & 0xFFFFU));
    writeLe16(&diag[4], static_cast<uint16_t>(g_debugAdvConnectIndCount & 0xFFFFU));
    writeLe16(&diag[6], static_cast<uint16_t>(g_debugPostAdvConnectedCount & 0xFFFFU));
    writeLe16(&diag[8], static_cast<uint16_t>(g_debugPostAdvDisconnectedCount & 0xFFFFU));
    writeLe16(&diag[10], static_cast<uint16_t>(g_debugDisconnectedRxPending & 0xFFFFU));
    writeLe16(&diag[12], static_cast<uint16_t>(g_debugBannerAttemptCount & 0xFFFFU));
    writeLe16(&diag[14], static_cast<uint16_t>(g_debugBannerWriteCount & 0xFFFFU));
    writeLe16(&diag[16], static_cast<uint16_t>(g_debugPumpAttemptCount & 0xFFFFU));
    writeLe16(&diag[18], static_cast<uint16_t>(g_debugPumpWriteCount & 0xFFFFU));
    (void)g_ble.setCustomGattCharacteristicValue(g_diagValueHandle, diag,
                                                 sizeof(diag));
  }
}

static void printAddress(const uint8_t* addr) {
  if (addr == nullptr) {
    return;
  }
  for (int i = 5; i >= 0; --i) {
    if (addr[i] < 16U) {
      Serial.print('0');
    }
    Serial.print(addr[i], HEX);
    if (i > 0) {
      Serial.print(':');
    }
  }
}

static void snapshotConnectionInfo() {
  BleConnectionInfo info{};
  if (!g_ble.getConnectionInfo(&info)) {
    return;
  }
  memcpy(const_cast<uint8_t*>(g_lastConnPeerAddress), info.peerAddress,
         sizeof(g_lastConnPeerAddress));
  g_lastConnPeerAddressRandom = info.peerAddressRandom ? 1U : 0U;
  g_lastConnAccessAddress = info.accessAddress;
  g_lastConnCrcInit = info.crcInit;
  g_lastConnIntervalUnits = info.intervalUnits;
  g_lastConnLatency = info.latency;
  g_lastConnTimeoutUnits = info.supervisionTimeoutUnits;
  memcpy(const_cast<uint8_t*>(g_lastConnChannelMap), info.channelMap,
         sizeof(g_lastConnChannelMap));
  g_lastConnChannelCount = info.channelCount;
  g_lastConnHopIncrement = info.hopIncrement;
  g_lastConnSleepClockAccuracy = info.sleepClockAccuracy;
}

static void snapshotDisconnectDebug() {
  BleDisconnectDebug dbg{};
  if (!g_ble.getDisconnectDebug(&dbg) || dbg.valid == 0U) {
    return;
  }
  g_lastDisconnectSequence = dbg.sequence;
  g_lastDisconnectNextEventUs = dbg.nextEventUs;
  g_lastDisconnectEventCounterDebug = dbg.eventCounter;
  g_lastDisconnectMissedEventCount = dbg.missedEventCount;
  g_lastDisconnectReason = dbg.reason;
  g_lastDisconnectRole = dbg.role;
  g_lastDisconnectErrorCode = dbg.errorCode;
  g_lastDisconnectExpectedRxSn = dbg.expectedRxSn;
  g_lastDisconnectTxSn = dbg.txSn;
  g_lastDisconnectReasonRemote =
      (dbg.reason == static_cast<uint8_t>(BleDisconnectReason::kPeerTerminate))
          ? 1U
          : 0U;
  g_lastDisconnectPendingTxValid = dbg.pendingTxValid;
  g_lastDisconnectPendingTxLlid = dbg.pendingTxLlid;
  g_lastDisconnectPendingTxLength = dbg.pendingTxLength;
  g_lastDisconnectLastTxOpcode = dbg.lastTxOpcode;
  g_lastDisconnectLastTxLength = dbg.lastTxLength;
  g_lastDisconnectLastRxOpcode = dbg.lastRxOpcode;
  g_lastDisconnectLastRxLength = dbg.lastRxLength;
  g_lastDisconnectValid = dbg.valid;
}

static void queueBanner() {
  if (g_bannerSent || !g_nus.isNotifyEnabled()) {
    return;
  }
  ++g_debugBannerAttemptCount;
  snapshotNusDebug(42U);
  if (g_nus.availableForWrite() < static_cast<int>(sizeof(kBanner) - 1U)) {
    return;
  }
  g_nus.write(reinterpret_cast<const uint8_t*>(kBanner), sizeof(kBanner) - 1U);
  ++g_debugBannerWriteCount;
  snapshotNusDebug(43U);
  g_bannerSent = true;
}

static bool connectionWarmupElapsed(uint32_t nowMs) {
  return (nowMs - g_connectedAtMs) >= kConnectionWarmupMs;
}

static void maybeRequestLinkSecurity(uint32_t nowMs) {
  if (!kRequestLinkSecurity || g_securityRequested || !g_ble.isConnected()) {
    return;
  }
  if (!connectionWarmupElapsed(nowMs)) {
    return;
  }
  g_securityRequested = true;
  g_ble.sendSmpSecurityRequest();
}

