lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/BLE/NordicUart/BleNordicUartLoopbackProbe/BleNordicUartLoopbackProbe.ino
static void pumpLoopback(uint8_t maxBytes) {
  // High-water gate: stop reading from rxBuffer once txBuffer holds more than
  // 2 × kPollBudgetBytes (40 bytes). kTxFreeMin is a fixed constant derived
  // from kPollBudgetBytes, not from the runtime maxPayloadLength(), so the
  // threshold is immune to ATT MTU negotiation enlarging maxPayloadLength()
  // to 244 bytes (which would have blocked all reads once txFree hit 242).
  // Bytes not yet read stay in rxBuffer (1 KB) and are retried once ACKs
  // drain the queued notifications.
  if (g_nus.availableForWrite() < kTxFreeMin || g_nus.available() <= 0) {
    return;
  }

  uint8_t buf[kPollBudgetBytes];
  uint8_t count = 0U;
  while (count < maxBytes && g_nus.available() > 0) {
    const int ch = g_nus.read();
    if (ch < 0) {
      break;
    }
    buf[count++] = static_cast<uint8_t>(ch);
  }
  if (count == 0U) {
    return;
  }
  const size_t written = g_nus.write(buf, count);
  ++g_debugPumpAttemptCount;
  if (written > 0U) {
    ++g_debugPumpWriteCount;
  }
  snapshotNusDebug(50U);
  g_echoedBytes += static_cast<uint32_t>(written);
  if (written < count) {
    g_droppedBytes += static_cast<uint32_t>(count - written);
  }
}

static void printTerminateStats(const BleConnectionEvent& evt) {
  Serial.print("[LB] Link terminated reason=0x");
  if (evt.disconnectReasonValid) {
    if (evt.disconnectReason < 0x10U) { Serial.print('0'); }
    Serial.print(evt.disconnectReason, HEX);
    Serial.print(evt.disconnectReasonRemote ? " (remote)" : " (local)");
  } else {
    Serial.print("??");
  }
  Serial.print(" echoed=");
  Serial.print(g_echoedBytes);
  Serial.print(" dropped=");
  Serial.print(g_droppedBytes);
  Serial.print(" nus_rx_drop=");
  Serial.print(g_nus.rxDroppedBytes());
  Serial.print(" nus_tx_drop=");
  Serial.print(g_nus.txDroppedBytes());
  Serial.print(" dbg_stage=");
  Serial.print(g_debugStage);
  Serial.print(" dbg_banner_try=");
  Serial.print(g_debugBannerAttemptCount);
  Serial.print(" dbg_banner_wr=");
  Serial.print(g_debugBannerWriteCount);
  Serial.print(" dbg_pump_try=");
  Serial.print(g_debugPumpAttemptCount);
  Serial.print(" dbg_pump_wr=");
  Serial.print(g_debugPumpWriteCount);
  Serial.print(" dbg_notify_seen=");
  Serial.print(g_debugNotifyEnabledCount);
  Serial.print(" dbg_txcnt=");
  Serial.print(g_debugNusTxCount);
  Serial.print(" dbg_lastq=");
  Serial.print(g_debugNusLastQueueResult);
  Serial.print(" dbg_sent=");
  Serial.print(g_debugNusSentCount);
  Serial.print(" dbg_retired=");
  Serial.print(g_debugNusRetiredCount);
  Serial.print(" dbg_inflight=");
  Serial.print(g_debugNusInFlight);
  Serial.print(" dbg_ack=");
  Serial.print(g_debugNusAwaitingAck);
  Serial.print("\r\n");

  BleEncryptionDebugCounters dbg{};
  g_ble.getEncryptionDebugCounters(&dbg);
  Serial.print("[LB] mic_fail=");   Serial.print(dbg.encRxMicFailCount);
  Serial.print(" rx_to=");          Serial.print(dbg.connRxTimeoutCount);
  Serial.print(" tx_to=");          Serial.print(dbg.connTxTimeoutCount);
  Serial.print(" missed_last=");    Serial.print(dbg.connMissedEventCountLast);
  Serial.print(" missed_max=");     Serial.print(dbg.connMissedEventCountMax);
  Serial.print(" tx_lag_max=");     Serial.print(dbg.txenLagMaxUs);
  // cb_drop: deferred GATT write callbacks dropped when the 4-slot ISR queue
  //   overflowed (LL ACKed the packet, but the app callback was silently lost).
  // evt_overwrite: background connection events dropped when the 8-slot queue
  //   was full (main loop too slow to drain); each lost event may have carried
  //   freshTxAllowed=1, which can temporarily stall txNotificationInFlight_.
  Serial.print(" cb_drop=");        Serial.print(dbg.connDeferredCallbackDropCount);
  Serial.print(" evt_overwrite=");  Serial.print(dbg.connDeferredEventOverwriteCount);
  Serial.print(" bg_isr=");         Serial.print(dbg.connBgServiceIsrCount);
  Serial.print(" bg_thr=");         Serial.print(dbg.connBgServiceThreadCount);
  Serial.print(" bg_due=");         Serial.print(dbg.connBgDueCount);
  Serial.print(" bg_wake_max=");    Serial.print(dbg.connBgWakeLagMaxUs);
  Serial.print(" bg_xo_pre=");      Serial.print(dbg.connBgHfxoPrewarmArmCount);
  Serial.print(" bg_xo_stop=");     Serial.print(dbg.connBgHfxoStopCount);
  Serial.print(" bg_xo_sw=");       Serial.print(dbg.connBgHfxoFallbackStartCount);
  Serial.print(" bg_rx_hw=");       Serial.print(dbg.connBgRxHardwareArmCount);
  Serial.print(" bg_rx_sw=");       Serial.print(dbg.connBgRxHardwareFallbackCount);
  Serial.print(" fast_att=");       Serial.print(dbg.connFastAttReadTurnaroundCount);
  Serial.print(" fast_ll=");        Serial.print(dbg.connFastLlControlTurnaroundCount);
  Serial.print(" fast_sig=");       Serial.print(dbg.connFastSignalingTurnaroundCount);
  Serial.print(" aar_try=");        Serial.print(dbg.connAarResolveAttemptCount);
  Serial.print(" aar_ok=");         Serial.print(dbg.connAarResolveSuccessCount);
  Serial.print(" aar_fail=");       Serial.print(dbg.connAarResolveFailureCount);
  Serial.print(" late_poll=");      Serial.print(dbg.connLatePollCount);
  Serial.print("\r\n");
}

void setup() {
  g_setupStage = 1U;
  Serial.begin(115200);
  delay(350);
  Serial.print("\r\nBleNordicUartLoopbackProbe start\r\n");

  Gpio::configure(kPinUserLed, GpioDirection::kOutput, GpioPull::kDisabled);
  Gpio::write(kPinUserLed, true);

  g_setupStage = 2U;
  bool ok = BoardControl::setAntennaPath(BoardAntennaPath::kCeramic);
  if (ok) {
    g_setupStage = 3U;
    ok = g_ble.begin(kTxPowerDbm);
  }
  if (ok) {
    g_setupStage = 4U;
    g_power.setLatencyMode(PowerLatencyMode::kLowPower);
  }
  if (ok) {
    uint8_t diag[20] = {0};
    uint16_t diagServiceHandle = 0U;
    uint16_t diagValueHandle = 0U;
    ok = (!kUseFixedAddress || g_ble.setDeviceAddress(kAddress, BleAddressType::kRandomStatic)) &&
         g_ble.setAdvertisingPduType(BleAdvPduType::kAdvInd) &&
         g_ble.setAdvertisingChannelSelectionAlgorithm2(true) &&
         g_ble.setGattDeviceName(kGattName) &&
         g_ble.setGattBatteryLevel(100U) &&
         g_ble.clearCustomGatt() &&
         g_nus.begin() &&
         g_ble.addCustomGattService(kDiagServiceUuid, &diagServiceHandle) &&
         g_ble.addCustomGattCharacteristic(diagServiceHandle, kDiagValueUuid,
                                          static_cast<uint8_t>(kBleGattPropRead),
                                          diag, sizeof(diag),
                                          &diagValueHandle, nullptr);
    g_diagServiceHandle = diagServiceHandle;
    g_diagValueHandle = diagValueHandle;
  }

  Serial.print("BLE NUS loopback init: ");
  Serial.print(ok ? "OK" : "FAIL");
  Serial.print("\r\n");
  if (!ok) {
    g_initOk = 0U;
    while (true) {
      delay(1000);
    }
    return;
  }
  g_initOk = 1U;
  g_setupStage = 5U;

  uint8_t addr[6] = {0};
  BleAddressType type = BleAddressType::kPublic;
  if (g_ble.getDeviceAddress(addr, &type)) {
    memcpy(const_cast<uint8_t*>(g_runtimeAddress), addr, sizeof(g_runtimeAddress));
    g_runtimeAddressType = static_cast<uint8_t>(type);
    Serial.print("addr=");
    printAddress(addr);
    Serial.print(" type=");
    Serial.print((type == BleAddressType::kRandomStatic) ? "random" : "public");
    Serial.print("\r\n");
  }
  Serial.print("Advertised as X54-LB\r\n");
  snapshotNusDebug(5U);
}

void loop() {
  if (kVerboseStatus) {
    BleEncryptionDebugCounters dbg{};
    g_ble.getEncryptionDebugCounters(&dbg);
    g_dbgLatePollCount = dbg.connLatePollCount;
    g_dbgConnRxTimeoutCount = dbg.connRxTimeoutCount;
    g_dbgConnMissedEventCountLast = dbg.connMissedEventCountLast;
    g_dbgConnMissedEventCountMax = dbg.connMissedEventCountMax;
  }

  if (!g_ble.isConnected()) {
    ++g_debugUnconnectedLoopCount;
    snapshotNusDebug(10U);
    if (kVerboseStatus) {
      ++g_unconnectedLoopCount;
    }
    BleAdvInteraction adv{};
    const bool advOk = g_ble.advertiseInteractEvent(&adv, 350U, 350000UL, 700000UL);
    if (adv.receivedConnectInd) {
      ++g_debugAdvConnectIndCount;
    }
    if (kVerboseStatus) {
      ++g_advertiseCallCount;
      if (advOk) {
        ++g_advertiseOkCount;
      } else {
        ++g_advertiseFailCount;
      }
      g_lastAdvChannel = static_cast<uint8_t>(adv.channel);
      g_lastAdvSawConnectInd = adv.receivedConnectInd ? 1U : 0U;
      g_lastAdvConnectIndChSel2 = adv.connectIndChSel2 ? 1U : 0U;
      g_lastAdvSawScanReq = adv.receivedScanRequest ? 1U : 0U;
      if (adv.receivedConnectInd) {
        ++g_advConnectIndCount;
      }
    }
    g_lastPostAdvConnected = g_ble.isConnected() ? 1U : 0U;
    if (g_lastPostAdvConnected != 0U) {
      ++g_debugPostAdvConnectedCount;
      snapshotNusDebug(12U);
      if (kVerboseStatus) {
        ++g_advConnectedAfterEventCount;
      }
      if (kEnableBleBgService) {
        g_debugCheckpoint = 14U;
        snapshotNusDebug(14U);
        Serial.print("DBG14 before bg enable\r\n");
        g_ble.setBackgroundConnectionServiceEnabled(true);
        g_debugCheckpoint = 15U;
        Serial.print("DBG15 after bg enable\r\n");
        snapshotNusDebug(15U);
      }
    } else if (adv.receivedConnectInd && kVerboseStatus) {
      ++g_advConnectIndLostBeforeLoopCount;
    } else {
      ++g_debugPostAdvDisconnectedCount;
      snapshotNusDebug(11U);
    }
    if (g_lastPostAdvConnected == 0U && !adv.receivedConnectInd) {
      g_debugCheckpoint = 16U;
      snapshotNusDebug(16U);
      Serial.print("DBG16 before nus service\r\n");
      g_nus.service();
      g_debugCheckpoint = 17U;
      snapshotNusDebug(17U);
      Serial.print("DBG17 after nus service\r\n");
      g_debugDisconnectedRxPending = static_cast<uint32_t>(g_nus.available());
      snapshotNusDebug((g_debugDisconnectedRxPending != 0U) ? 13U : g_debugStage);
    }

    if (g_wasConnected) {
      g_wasConnected = false;
      g_power.setLatencyMode(PowerLatencyMode::kLowPower);
      g_bannerSent = false;
      g_securityRequested = false;
      ++g_disconnectCount;
      Gpio::write(kPinUserLed, true);
      if (kVerboseStatus) {
        Serial.print("BLE client disconnected\r\n");
      }
    }

    if (!g_ble.isConnected() && !adv.receivedConnectInd) {
      delay(100);
    }
    return;
  }

  if (!g_wasConnected) {
    g_wasConnected = true;
    g_bannerSent = false;
    g_securityRequested = false;
    g_connectedAtMs = millis();
    g_echoedBytes = 0U;
    g_droppedBytes = 0U;
    ++g_connectCount;
    snapshotNusDebug(30U);
    Gpio::write(kPinUserLed, false);
    if (kEnableBleBgService) {
      g_ble.setBackgroundConnectionServiceEnabled(true);
    }
    if (kVerboseStatus) {
      Serial.print("BLE client connected\r\n");
    }
  }

  BleConnectionEvent evt{};
  const bool eventStarted =
      g_ble.pollConnectionEvent(&evt, kForegroundPollTimeoutUs) && evt.eventStarted;

  // The HAL deferred event queue is not flushed on disconnect. The first
  // pollConnectionEvent() of a new connection may return the previous
  // connection's terminateInd=true. Passing that stale event to
  // g_nus.service() would reset the NUS CCCD state, forcing Android to
  // re-discover and re-write it — causing the "serial not connected" symptom.
  // Guard: if terminateInd arrives while isConnected() is true, it is stale.
  if (evt.terminateInd && g_ble.isConnected()) {
    evt.terminateInd = false;
  }

