lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/BLE/NordicUart/BleNordicUartLoopbackProbe/BleNordicUartLoopbackProbe.ino
  if (!eventStarted) {
    if (kVerboseStatus) {
      ++g_pollNoEventCount;
    }
    g_nus.service();
    const uint32_t nowMs = millis();
    maybeRequestLinkSecurity(nowMs);
    if (!connectionWarmupElapsed(nowMs)) {
      return;
    }
    queueBanner();
    pumpLoopback(2U);
    // terminateInd can arrive without a full event in the background-service
    // path; handle it here so the disconnect stats are never missed.
    if (evt.terminateInd) {
      snapshotDisconnectDebug();
      printTerminateStats(evt);
    }
    return;
  }

  if (kVerboseStatus) {
    ++g_pollEventCount;
    g_lastEventCounter = evt.eventCounter;
    g_lastDataChannel = evt.dataChannel;
  }
  g_nus.service(&evt);
  const uint32_t nowMs = millis();
  maybeRequestLinkSecurity(nowMs);
  if (!connectionWarmupElapsed(nowMs)) {
    if (evt.terminateInd) {
      printTerminateStats(evt);
    }
    return;
  }
  queueBanner();
  pumpLoopback(kPollBudgetBytes);

  if (evt.terminateInd) {
    if (evt.disconnectReasonValid) {
      g_lastDisconnectReason = evt.disconnectReason;
      g_lastDisconnectReasonRemote = evt.disconnectReasonRemote ? 1U : 0U;
    }
    snapshotDisconnectDebug();
    printTerminateStats(evt);
  }

  if (kVerboseStatus && ((nowMs - g_lastStatusMs) >= kStatusPeriodMs)) {
    g_lastStatusMs = nowMs;
    Serial.print("notify=");
    Serial.print(g_nus.isNotifyEnabled() ? "on" : "off");
    Serial.print(" rx_pending=");
    Serial.print(g_nus.available());
    Serial.print(" tx_pending=");
    Serial.print(g_nus.availableForWrite());
    Serial.print(" echoed=");
    Serial.print(g_echoedBytes);
    Serial.print(" dropped=");
    Serial.print(g_droppedBytes);
    Serial.print("\r\n");
  }
}
